web-app/web-app-old/src/implementation/rest/index.org
#+TITLE: The REST API
#+AUTHOR: VLEAD
#+DATE: [2016-05-11 Wed]
#+PROPERTY: results output
#+PROPERTY: exports code
#+SETUPFILE: ../org-templates/level-1.org
#+options: ^:nil
#+LATEX: Literal LaTeX code for export


This document illustrates building of the REST API.
* REST

** Initialization
#+BEGIN_SRC python :tangle ../../src/api.py :eval no

# -*- coding: utf-8 -*-

import os
import csv
import requests
from datetime import datetime
import inspect
from flask import session, render_template, Blueprint, request, jsonify, abort, current_app, redirect, url_for
from config import *
from flask import current_app

from flask import Flask, redirect, url_for
from werkzeug import secure_filename

from db import *
from utils_new import parse_request, jsonify_list
api = Blueprint('APIs', __name__)

system = System()
#+END_SRC

** URL mappping for REST API

|-------------+--------------------+-----------------------|
| METHOD      | FUNCTION           | URL                   |
|-------------+--------------------+-----------------------|
| GET         | get_users          | /users                |
|-------------+--------------------+-----------------------|
| GET         | get_roles          | /roles                |
|-------------+--------------------+-----------------------|
| GET         | get_user_by_id     | /users/<int:id>       |
|-------------+--------------------+-----------------------|
| GET         | get_role_by_id     | /roles/<int:id>       |
|-------------+--------------------+-----------------------|
| POST        | create_user        | /users                |
|-------------+--------------------+-----------------------|
| POST        | create_role        | /roles                |
|-------------+--------------------+-----------------------|
| PUT, DELETE | update_delete_user | /users/<int:id>       |
|-------------+--------------------+-----------------------|
| PUT, DELETE | update_delete_role | /roles/<int:id>       |
|-------------+--------------------+-----------------------|
| GET         | get_user_by_email  | /users/get_email      |
|-------------+--------------------+-----------------------|
| GET         | get_email_of_user  | /users/<int:id>/email |
|-------------+--------------------+-----------------------|
| GET         | get_name_of_user   | /users/<int:id>/name  |
|-------------+--------------------+-----------------------|
| PUT         | change_user_email  | /users/<int:id>email  |
|-------------+--------------------+-----------------------|
| GET         | index              | /                     |
|-------------+--------------------+-----------------------|
| GET, POST   | login              | /auth/login           |
|-------------+--------------------+-----------------------|
| GET         | logout             | /auth/logout          |
|-------------+--------------------+-----------------------|
                                    
** GET all users
   This is the REST API method to get all the users stored in the user set of
   the system class.
#+BEGIN_SRC python :tangle ../../src/api.py :eval no
@api.route('/users', methods=['GET'])
def get_users():
    global system
    system.get_users_from_database()
    return jsonify_list([i.to_client() for i in system.user_set])
#+END_SRC
   
** GET all roles
   The is the REST API method to get all the roles stored in the Role table.

#+BEGIN_SRC python :tangle ../../src/api.py :eval no
@api.route('/roles', methods=['GET'])
def get_roles():
    return jsonify_list([i.to_client() for i in Role.get_all()])
#+END_SRC

** GET a user with id
   This is the REST API method to get a user by id.
#+BEGIN_SRC python :tangle ../../src/api.py :eval no
@api.route('/users/<int:id>', methods=['GET'])
def get_user_by_id(id):
    record = User.get_by_id(id)
    if not record:
        abort(404, "No entry for %s with id: %s found." % ("user", id))

    return jsonify(record.to_client())
#+END_SRC

** GET a role with id
   This is the REST API method to get a role by id, from the Role table.
#+BEGIN_SRC python :tangle ../../src/api.py :eval no
@api.route('/roles/<int:id>', methods=['GET'])
def get_role_by_id(id):
    record = Role.get_by_id(id)
    if not record:
        abort(404, "No entry for %s with id: %s found." % ("role", id))

    return jsonify(record.to_client())
#+END_SRC

