web-app/web-app-old/src/implementation/rest/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-06-02 Thu 23:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>The REST API</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
</head>
<body>
<div id="content">
<h1 class="title">The REST API</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline23">1. REST</a>
<ul>
<li><a href="#orgheadline1">1.1. Initialization</a></li>
<li><a href="#orgheadline2">1.2. URL mappping for REST API</a></li>
<li><a href="#orgheadline3">1.3. GET all users</a></li>
<li><a href="#orgheadline4">1.4. GET all roles</a></li>
<li><a href="#orgheadline5">1.5. GET a user with id</a></li>
<li><a href="#orgheadline6">1.6. GET a role with id</a></li>
<li><a href="#orgheadline7">1.7. Create a user</a></li>
<li><a href="#orgheadline8">1.8. Create a role</a></li>
<li><a href="#orgheadline10">1.9. Update/Delete user</a>
<ul>
<li><a href="#orgheadline9">1.9.1. Implementation</a></li>
</ul>
</li>
<li><a href="#orgheadline12">1.10. Update/Delete a role</a>
<ul>
<li><a href="#orgheadline11">1.10.1. Implementation</a></li>
</ul>
</li>
<li><a href="#orgheadline14">1.11. Get user by email</a></li>
<li><a href="#orgheadline16">1.12. Get email of user</a>
<ul>
<li><a href="#orgheadline15">1.12.1. Implementation</a></li>
</ul>
</li>
<li><a href="#orgheadline18">1.13. Get name of user</a>
<ul>
<li><a href="#orgheadline17">1.13.1. Implementation</a></li>
</ul>
</li>
<li><a href="#orgheadline20">1.14. Set email of user</a>
<ul>
<li><a href="#orgheadline19">1.14.1. Implementation</a></li>
</ul>
</li>
<li><a href="#orgheadline22">1.15. Login/Logout</a>
<ul>
<li><a href="#orgheadline21">1.15.1. Implementation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline52">2. Tests for REST API</a>
<ul>
<li><a href="#orgheadline24">2.1. Initialization</a></li>
<li><a href="#orgheadline50">2.2. User Tests</a>
<ul>
<li><a href="#orgheadline25">2.2.1. Initialization</a></li>
<li><a href="#orgheadline27">2.2.2. test_get_all_users</a></li>
<li><a href="#orgheadline29">2.2.3. test_get_one_user</a></li>
<li><a href="#orgheadline31">2.2.4. test_update_existing_user</a></li>
<li><a href="#orgheadline33">2.2.5. test_create_new_user</a></li>
<li><a href="#orgheadline35">2.2.6. test_delete_user</a></li>
<li><a href="#orgheadline37">2.2.7. test_create_role</a></li>
<li><a href="#orgheadline39">2.2.8. test_update_role</a></li>
<li><a href="#orgheadline41">2.2.9. test_delete_role</a></li>
<li><a href="#orgheadline43">2.2.10. test_get_user_by_email</a></li>
<li><a href="#orgheadline45">2.2.11. test_get_email_of_user</a></li>
<li><a href="#orgheadline47">2.2.12. test_get_name_of_user</a></li>
<li><a href="#orgheadline49">2.2.13. test_set_email_of_user</a></li>
</ul>
</li>
<li><a href="#orgheadline51">2.3. Run Tests</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This document illustrates building of the REST API.
</p>
<div id="outline-container-orgheadline23" class="outline-2">
<h2 id="orgheadline23"><span class="section-number-2">1</span> REST</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Initialization</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-python"># -*- coding: utf-8 -*-

import os
import csv
import requests
from datetime import datetime
import inspect
from flask import session, render_template, Blueprint, request, jsonify, abort, current_app, redirect, url_for
from config import *
from flask import current_app

from flask import Flask, redirect, url_for
from werkzeug import secure_filename

from db import *
from utils_new import parse_request, jsonify_list
api = Blueprint('APIs', __name__)

system = System()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> URL mappping for REST API</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">METHOD</th>
<th scope="col" class="org-left">FUNCTION</th>
<th scope="col" class="org-left">URL</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">get_users</td>
<td class="org-left">/users</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">get_roles</td>
<td class="org-left">/roles</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">get_user_by_id</td>
<td class="org-left">/users/&lt;int:id&gt;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">get_role_by_id</td>
<td class="org-left">/roles/&lt;int:id&gt;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">POST</td>
<td class="org-left">create_user</td>
<td class="org-left">/users</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">POST</td>
<td class="org-left">create_role</td>
<td class="org-left">/roles</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">PUT, DELETE</td>
<td class="org-left">update_delete_user</td>
<td class="org-left">/users/&lt;int:id&gt;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">PUT, DELETE</td>
<td class="org-left">update_delete_role</td>
<td class="org-left">/roles/&lt;int:id&gt;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">get_user_by_email</td>
<td class="org-left">/users/get_email</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">get_email_of_user</td>
<td class="org-left">/users/&lt;int:id&gt;/email</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">get_name_of_user</td>
<td class="org-left">/users/&lt;int:id&gt;/name</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">PUT</td>
<td class="org-left">change_user_email</td>
<td class="org-left">/users/&lt;int:id&gt;email</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">index</td>
<td class="org-left">/</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">GET, POST</td>
<td class="org-left">login</td>
<td class="org-left">/auth/login</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">logout</td>
<td class="org-left">/auth/logout</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> GET all users</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This is the REST API method to get all the users stored in the user set of
the system class.
</p>
<div class="org-src-container">

<pre class="src src-python">@api.route('/users', methods=['GET'])
def get_users():
    global system
    system.get_users_from_database()
    return jsonify_list([i.to_client() for i in system.user_set])
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.4</span> GET all roles</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The is the REST API method to get all the roles stored in the Role table.
</p>

<div class="org-src-container">

<pre class="src src-python">@api.route('/roles', methods=['GET'])
def get_roles():
    return jsonify_list([i.to_client() for i in Role.get_all()])
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">1.5</span> GET a user with id</h3>
<div class="outline-text-3" id="text-1-5">
<p>
This is the REST API method to get a user by id.
</p>
<div class="org-src-container">

<pre class="src src-python">@api.route('/users/&lt;int:id&gt;', methods=['GET'])
def get_user_by_id(id):
    record = User.get_by_id(id)
    if not record:
        abort(404, "No entry for %s with id: %s found." % ("user", id))

    return jsonify(record.to_client())
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">1.6</span> GET a role with id</h3>
<div class="outline-text-3" id="text-1-6">
<p>
This is the REST API method to get a role by id, from the Role table.
</p>
<div class="org-src-container">

<pre class="src src-python">@api.route('/roles/&lt;int:id&gt;', methods=['GET'])
def get_role_by_id(id):
    record = Role.get_by_id(id)
    if not record:
        abort(404, "No entry for %s with id: %s found." % ("role", id))

    return jsonify(record.to_client())
</pre>
</div>
</div>
</div>
