web-app/web-app-old/src/implementation/rest/index.org
** Create a user
   This is the REST API method for creating a user. Only a user, who is an
   admin and is currently logged in may create a user.
   Usage:
   #+BEGIN_EXAMPLE
   POST request
   {
   "name": "Jimi hendrix",
   "email": "jimi@gmail.com",
   "role": 2,
   "session": "admin@vlabs.ac.in"
   }
   #+END_EXAMPLE

#+BEGIN_SRC python :tangle ../../src/api.py :eval no

# not implemented for session, implement with session
@api.route('/users', methods=['POST'])
def create_user():

    ### Check if there is a session and act according to the specification
    global system
    if not request.json or not 'name' in request.json or not 'email' in request.json:
        abort(400)
    else:
        name = request.json['name']
        email = request.json['email']
        role = request.json['role']
        session_email = request.json['session']

        try:
            user = User(name=name,
                        email=email,
                        role=Role.get_by_id(role))

            user.save()
            system.user_set = User.get_all()
            return jsonify(user.to_client())
        except Exception, e:
            current_app.logger.error("Error occured while inserting"
                                     "user record: %s" % str(e))
            abort(500, str(e))
#+END_SRC

** Create a role
   This is the REST API method to create a role.

#+BEGIN_SRC python :tangle ../../src/api.py :eval no

@api.route('/roles', methods=['POST'])
def create_role():
    if not request.json or not 'name' in request.json:
        abort(400)
    else:
        name = request.json['name']
        try:
            role = Role(name)
            role.save()
            return jsonify(role.to_client())
        except Exception, e:
            current_app.logger.error("Error occured while inserting" 
                                     "role record: %s" % str(e))
            abort(500, str(e))

#+END_SRC

** Update/Delete user
   This is the REST API method to update or delete a user from the user set of
   the System object. An admin user may update or delete anyone. However, a
   user can only update himself. Also, an admin cannot delete himself.
*** Implementation
#+BEGIN_SRC python :tangle ../../src/api.py :eval no
@api.route('/users/<int:id>', methods=['PUT'])
def update_user(id):
    global system
    user_session = None
                   
    system.get_users_from_database()
    record = User.get_by_id(id)
    if not record:
        abort(404, 'No %s with id %s' % (user, id))
    
    
    
    for s in system.session_set:
        if s.user.email==request.json['session']:
            user_session=s

    role = record.role
            
    print user_session.user.email
    new_data = {}
    try:
        
        if 'name' in request.json:
            #system.set_name_of_user(record, request.json['name'], user_session)
            new_data['name'] = request.json['name']
        if 'email' in request.json:
            #system.set_email_of_user(record, request.json['email'], user_session)
            new_data['email'] = request.json['email']
        if 'role_id' in request.json:
            role = Role.get_by_id(request.json['role_id'])
        
        record.role = role
        system.logout(record,user_session)
        record.update(**new_data)
        system.get_users_from_database()
        
        
        session['role_name'] = record.role.name
        #session['user_id'] = record.id
        session['email'] = record.email
        system.login(record)
        return jsonify(User.get_by_id(id).to_client())
    except Exception, e:
        current_app.logger.error("Error occured while updating"
                                     " user record %d: %s" % (id, str(e)))
        abort(500, str(e))



@api.route('/users/<int:id>', methods=['DELETE'])
def delete_user(id):
    global system
    session = None
                   
    system.get_users_from_database()
    record = User.get_by_id(id)
    if not record:
        abort(404, 'No %s with id %s' % (user, id))

    
    delete_session_email= request.headers.get('session')
    delete_session = None
    for x in system.session_set:
        if x.user.email == delete_session_email:
            delete_session = x
    try:
   
        system.del_user(record,delete_session)
        return jsonify(id=id, status="success")
    except Exception, e:
        current_app.logger.error("Error occured while deleting"
                                     "user record %d: %s" % (id, str(e)))
        abort(500, str(e))

#+END_SRC
** Update/Delete a role
   This is the REST API method to update or delete a role in the role table.
*** Implementation
#+BEGIN_SRC python :tangle ../../src/api.py :eval no
@api.route('/roles/<int:id>', methods=['PUT', 'DELETE'])
def update_delete_role(id):

    if 'session' not in request.json:
        abort(400)
    else:
        print "choose according to configuraton"
    record = Role.get_by_id(id)
    if not record:
        abort(404, 'No %s with id %s' % (role, id))

    if request.method == 'DELETE':
        try:
            record.delete()
            return jsonify(id=id, status="success")
        except Exception, e:
            current_app.logger.error("Error occured while deleting "
                                     "role record %d: %s" % (id, str(e)))
            abort(500, str(e))

    if request.method == 'PUT':
        try:
            if 'role' in request.json:
                record.role = request.json['role']

            record.update()
            
            return jsonify(Role.get_by_id(id).to_client())

        except Exception, e:
            current_app.logger.error("Error occured while updating "
                                     "role record %d: %s" % (id, str(e)))
            abort(500, str(e))
#+END_SRC


** Get user by email
   This is the REST API method to get a user from the user set by passing an email.
**** Implementation
#+BEGIN_SRC python :tangle ../../src/api.py :eval no
@api.route('/users/get_email', methods=['GET'])
def get_user_by_email():
    global system
    system.get_users_from_database()

    if 'email' not in request.json:
        abort(400)
    else:
        print "choose according to configuraton"
    
    record = None

    for x in system.user_set:
        if x.email == request.json['email']:
            record = x
    
    if not record:
        abort(404, "No entry for %s with id: %s found." % ("user", id))

    return jsonify(record.to_client())
#+END_SRC

** Get email of user
   This is the REST API method to get the email of a particular user in the
   user set.
