web-app/web-app-old/src/implementation/rest/index.html

<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">1.7</span> Create a user</h3>
<div class="outline-text-3" id="text-1-7">
<p>
This is the REST API method for creating a user. Only a user, who is an
admin and is currently logged in may create a user.
Usage:
</p>
<pre class="example">
POST request
{
"name": "Jimi hendrix",
"email": "jimi@gmail.com",
"role": 2,
"session": "admin@vlabs.ac.in"
}
</pre>

<div class="org-src-container">

<pre class="src src-python"># not implemented for session, implement with session
@api.route('/users', methods=['POST'])
def create_user():

    ### Check if there is a session and act according to the specification
    global system
    if not request.json or not 'name' in request.json or not 'email' in request.json:
        abort(400)
    else:
        name = request.json['name']
        email = request.json['email']
        role = request.json['role']
        session_email = request.json['session']

        try:
            user = User(name=name,
                        email=email,
                        role=Role.get_by_id(role))

            user.save()
            system.user_set = User.get_all()
            return jsonify(user.to_client())
        except Exception, e:
            current_app.logger.error("Error occured while inserting"
                                     "user record: %s" % str(e))
            abort(500, str(e))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">1.8</span> Create a role</h3>
<div class="outline-text-3" id="text-1-8">
<p>
This is the REST API method to create a role.
</p>

<div class="org-src-container">

<pre class="src src-python">@api.route('/roles', methods=['POST'])
def create_role():
    if not request.json or not 'name' in request.json:
        abort(400)
    else:
        name = request.json['name']
        try:
            role = Role(name)
            role.save()
            return jsonify(role.to_client())
        except Exception, e:
            current_app.logger.error("Error occured while inserting" 
                                     "role record: %s" % str(e))
            abort(500, str(e))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">1.9</span> Update/Delete user</h3>
<div class="outline-text-3" id="text-1-9">
<p>
This is the REST API method to update or delete a user from the user set of
the System object. An admin user may update or delete anyone. However, a
user can only update himself. Also, an admin cannot delete himself.
</p>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">1.9.1</span> Implementation</h4>
<div class="outline-text-4" id="text-1-9-1">
<div class="org-src-container">

<pre class="src src-python">@api.route('/users/&lt;int:id&gt;', methods=['PUT', 'DELETE'])
def update_delete_user(id):
    global system
    session = None
    ### Check if there is a session and act according to the specification
    #if 'session' not in request.json:
    #    print "throw error"
    #else:
    #    print "Check according to your specification"
    

    
    #print request.json['session']

    #admin_user = User.get_by_id(1)
    #system.add_session(admin_user)
    #session = system.session_set[0]
                   
    system.get_users_from_database()
    record = User.get_by_id(id)
    if not record:
        abort(404, 'No %s with id %s' % (user, id))

    if request.method == 'DELETE':
    
        delete_session_email= request.headers.get('session')
        delete_session = None
        for x in system.session_set:
            if x.user.email == delete_session_email:
                delete_session = x
        try:
            #record.delete()
            system.del_user(record,delete_session)
            return jsonify(id=id, status="success")
        except Exception, e:
            current_app.logger.error("Error occured while deleting"
                                     "user record %d: %s" % (id, str(e)))
            abort(500, str(e))

    if request.method == 'PUT':
    
        print system.session_set
        for x in system.session_set:
            print x.user.email
        for s in system.session_set:
            if s.user.email==request.json['session']:
                session=s
    
        print session.user.email
        new_data = {}
        try:
            if 'name' in request.json:
                #new_data['name'] = request.json['name']
                system.set_name_of_user(record, request.json['name'], session)
            if 'email' in request.json:
                #new_data['email'] = request.json['email']
                system.set_email_of_user(record, request.json['email'], session)
            if 'role_id' in request.json:
                role = Role.get_by_id(request.json['role_id'])
                #new_data['role'] = role

            record.role = role
            record.update()

            return jsonify(User.get_by_id(id).to_client())

        except Exception, e:
            current_app.logger.error("Error occured while updating"
                                     " user record %d: %s" % (id, str(e)))
            abort(500, str(e))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">1.10</span> Update/Delete a role</h3>
<div class="outline-text-3" id="text-1-10">
<p>
This is the REST API method to update or delete a role in the role table.
</p>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">1.10.1</span> Implementation</h4>
<div class="outline-text-4" id="text-1-10-1">
<div class="org-src-container">

<pre class="src src-python">@api.route('/roles/&lt;int:id&gt;', methods=['PUT', 'DELETE'])
def update_delete_role(id):

    if 'session' not in request.json:
        abort(400)
    else:
        print "choose according to configuraton"
    record = Role.get_by_id(id)
    if not record:
        abort(404, 'No %s with id %s' % (role, id))

    if request.method == 'DELETE':
        try:
            record.delete()
            return jsonify(id=id, status="success")
        except Exception, e:
            current_app.logger.error("Error occured while deleting "
                                     "role record %d: %s" % (id, str(e)))
            abort(500, str(e))

    if request.method == 'PUT':
        try:
            if 'role' in request.json:
                record.role = request.json['role']

            record.update()
            
            return jsonify(Role.get_by_id(id).to_client())

        except Exception, e:
            current_app.logger.error("Error occured while updating "
                                     "role record %d: %s" % (id, str(e)))
            abort(500, str(e))
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">1.11</span> Get user by email</h3>
<div class="outline-text-3" id="text-1-11">
<p>
This is the REST API method to get a user from the user set by passing an email.
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline13"></a>Implementation<br  /><div class="outline-text-5" id="text-1-11-0-1">
<div class="org-src-container">

<pre class="src src-python">@api.route('/users/get_email', methods=['GET'])
def get_user_by_email():
    global system
    system.get_users_from_database()

    if 'email' not in request.json:
        abort(400)
    else:
        print "choose according to configuraton"
    
    record = None

    for x in system.user_set:
        if x.email == request.json['email']:
            record = x
    
    if not record:
        abort(404, "No entry for %s with id: %s found." % ("user", id))

    return jsonify(record.to_client())
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">1.12</span> Get email of user</h3>
<div class="outline-text-3" id="text-1-12">
<p>
This is the REST API method to get the email of a particular user in the
user set.
</p>
</div>
