web-app/web-app-old/src/implementation/rest/index.org
*** Implementation

#+BEGIN_SRC python :tangle ../../src/api.py :eval no
@api.route('/users/<int:id>/email', methods=['GET'])
def get_email_of_user(id):
    global system

    session = None
    system.get_users_from_database()
    if 'session' not in request.json:
        abort(400)
    else:
        print "choose according to configuraton"
    

    for s in system.session_set:
        if s.user.email==request.json['session']:
            session=s
    record = User.get_by_id(id)         
    if not record:
        abort(404, 'No %s with id %s' % (user, id))

        

    #if email_check == "email":
    #system.user_set = User.get_all()
    #record = User.get_by_id(id)
    new_data = {}
    new_data['email'] = system.get_email_of_user(record, session)        
    #if not record:
    #    abort(404, "No entry for %s with id: %s found." % ("user", id))

    return jsonify(new_data)

#+END_SRC

** Get name of user
   This is the REST API method to get the name of the user in the user set.
*** Implementation

#+BEGIN_SRC python :tangle ../../src/api.py :eval no
@api.route('/users/<int:id>/name', methods=['GET'])
def get_name_of_user(id):
    global system

    session = None
    system.get_users_from_database()
    if 'session' not in request.json:
        abort(400)
    else:
        print "choose according to configuraton"
    

    for s in system.session_set:
        if s.user.email==request.json['session']:
            session=s
    record = User.get_by_id(id)         
    if not record:
        abort(404, 'No %s with id %s' % (user, id))

        

    #if email_check == "email":
    #system.user_set = User.get_all()
    #record = User.get_by_id(id)
    new_data = {}
    new_data['name'] = system.get_name_of_user(record, session)        
    #if not record:
    #    abort(404, "No entry for %s with id: %s found." % ("user", id))

    return jsonify(new_data)

#+END_SRC

** Set email of user 
   This is the REST API method to set the email of a user. This method also
   checks if the entered email exists in the database. If so, it does not allow
   the change.
   
*** Implementation
#+BEGIN_SRC python :tangle ../../src/api.py :eval no
@api.route('/users/<int:id>/email', methods=['PUT'])
def change_user_email(id):

    record = User.get_by_id(id)
    global system

    system.get_users_from_database()
    if not record:
        abort(404, 'No %s with id %s' % (user, id))

    session = None
    #system.get_users_from_database()
    if 'session' not in request.json:
        abort(400)
    else:
        print "choose according to configuraton"
    

    for s in system.session_set:
        if s.user.email==request.json['session']:
            session=s
    

#    if request.method == 'DELETE':
#        try:
#            record.delete()
#            return jsonify(id=id, status="success")
#        except Exception, e:
#            current_app.logger.error("Error occured while deleting"
#                                     "user record %d: %s" % (id, str(e)))
#            abort(500, str(e))

#    if request.method == 'PUT':
    #if email_update == "change_email":
    new_data = {}
    try:
            #if 'name' in request.json:
        new_data['name'] = system.get_name_of_user(record, session)
        if 'email' in request.json:
            new_data['email'] = request.json['email']
            #if 'roles' in request.json:
            #    role_ids = request.json['roles']
            #    roles = []
            #    for role_id in role_ids:
            #        roles.append(Role.get_by_id(role_id))
        new_data['role'] = system.get_role_of_user(record,session)
        #new_data['session'] = record.session
        record.update(**new_data)
        system.get_users_from_database()
        return jsonify(User.get_by_id(id).to_client())

    except Exception, e:
        current_app.logger.error("Error occured while updating"
                                     "user record %d: %s" % (id, str(e)))
        abort(500, str(e))
#+END_SRC


** Login/Logout
    These are the REST API methods for login and logout.
    If the user is already logged in then it will redirect to 'user-list.html'
    otherwise it will take a user to 'login.html'.

*** Implementation
#+BEGIN_SRC python :tangle ../../src/api.py
@api.route("/", methods=['GET'])
def index():
    if request.method == 'GET':
        if ('email' in session):
            return render_template("user-list.html")
        else:
            return render_template("login.html")

@api.route("/auth/login", methods=['GET', 'POST'])
def login():
    global system
    user=None
    if request.method == 'POST':
        email = str(request.form['email'])
        url_for_getting_the_user = "%s/users" % \
                                   (APP_URL)
        backend_resp = requests.get(url_for_getting_the_user)
        user_list = backend_resp.json()
        if len(backend_resp.text.encode('ascii')) != 2:
            count = 0
            for user in range(len(user_list)):
                print len(user_list)
                print user_list[user]
                if str(email) == str(user_list[user]['email']):
                    current_app.logger.info("Successfully Logged in")
                    session['email'] = str(user_list[user]['email'])
                    session['role_name'] = str(user_list[user]['role']['name'])
                    session['user_id'] = str(user_list[user]['id'])
                    for u in system.user_set:
                        if u.email==str(email):
                           user=u
                    system.login(user)
                    print system.session_set
                    for x in system.session_set:
                        print x.user.email
                    return redirect("/")
                else:
                    count = count + 1
            if count == len(user_list):
                return render_template("login.html", message="Invalid email id")
            
@api.route('/auth/logout', methods=['GET'])
def logout_handler():
    global system
    
    
    user=None
    ses=None
    system.get_users_from_database()
    for s in system.session_set:
        if(s.user.email == session['email'] ):
            ses=s
    for u in system.user_set:
        if(u.email == session['email']):
            user=u
    system.logout(user,ses)
    session.pop('email', None)
    session.pop('role_name', None)   
    return redirect("/")

#+END_SRC


* Tests for REST API
** Initialization
#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no

# -*- coding: utf-8 -*-

import unittest
from flask.ext.testing import TestCase
from datetime import datetime
# import json

from src.db import *
from src.app import create_app
from src.op_exceptions import AttributeRequired
from src.api import system
config = {
    'SQLALCHEMY_DATABASE_URI': ''
}

#+END_SRC

