web-app/web-app-old/src/implementation/rest/index.html
<div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="section-number-4">1.12.1</span> Implementation</h4>
<div class="outline-text-4" id="text-1-12-1">
<div class="org-src-container">

<pre class="src src-python">@api.route('/users/&lt;int:id&gt;/email', methods=['GET'])
def get_email_of_user(id):
    global system

    session = None
    system.get_users_from_database()
    if 'session' not in request.json:
        abort(400)
    else:
        print "choose according to configuraton"
    

    for s in system.session_set:
        if s.user.email==request.json['session']:
            session=s
    record = User.get_by_id(id)         
    if not record:
        abort(404, 'No %s with id %s' % (user, id))

        

    #if email_check == "email":
    #system.user_set = User.get_all()
    #record = User.get_by_id(id)
    new_data = {}
    new_data['email'] = system.get_email_of_user(record, session)        
    #if not record:
    #    abort(404, "No entry for %s with id: %s found." % ("user", id))

    return jsonify(new_data)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">1.13</span> Get name of user</h3>
<div class="outline-text-3" id="text-1-13">
<p>
This is the REST API method to get the name of the user in the user set.
</p>
</div>
<div id="outline-container-orgheadline17" class="outline-4">
<h4 id="orgheadline17"><span class="section-number-4">1.13.1</span> Implementation</h4>
<div class="outline-text-4" id="text-1-13-1">
<div class="org-src-container">

<pre class="src src-python">@api.route('/users/&lt;int:id&gt;/name', methods=['GET'])
def get_name_of_user(id):
    global system

    session = None
    system.get_users_from_database()
    if 'session' not in request.json:
        abort(400)
    else:
        print "choose according to configuraton"
    

    for s in system.session_set:
        if s.user.email==request.json['session']:
            session=s
    record = User.get_by_id(id)         
    if not record:
        abort(404, 'No %s with id %s' % (user, id))

        

    #if email_check == "email":
    #system.user_set = User.get_all()
    #record = User.get_by_id(id)
    new_data = {}
    new_data['name'] = system.get_name_of_user(record, session)        
    #if not record:
    #    abort(404, "No entry for %s with id: %s found." % ("user", id))

    return jsonify(new_data)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">1.14</span> Set email of user</h3>
<div class="outline-text-3" id="text-1-14">
<p>
This is the REST API method to set the email of a user. This method also
checks if the entered email exists in the database. If so, it does not allow
the change.
</p>
</div>

<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19"><span class="section-number-4">1.14.1</span> Implementation</h4>
<div class="outline-text-4" id="text-1-14-1">
<div class="org-src-container">

<pre class="src src-python">@api.route('/users/&lt;int:id&gt;/email', methods=['PUT'])
def change_user_email(id):

    record = User.get_by_id(id)
    global system

    system.get_users_from_database()
    if not record:
        abort(404, 'No %s with id %s' % (user, id))

    session = None
    #system.get_users_from_database()
    if 'session' not in request.json:
        abort(400)
    else:
        print "choose according to configuraton"
    

    for s in system.session_set:
        if s.user.email==request.json['session']:
            session=s
    

#    if request.method == 'DELETE':
#        try:
#            record.delete()
#            return jsonify(id=id, status="success")
#        except Exception, e:
#            current_app.logger.error("Error occured while deleting"
#                                     "user record %d: %s" % (id, str(e)))
#            abort(500, str(e))

#    if request.method == 'PUT':
    #if email_update == "change_email":
    new_data = {}
    try:
            #if 'name' in request.json:
        new_data['name'] = system.get_name_of_user(record, session)
        if 'email' in request.json:
            new_data['email'] = request.json['email']
            #if 'roles' in request.json:
            #    role_ids = request.json['roles']
            #    roles = []
            #    for role_id in role_ids:
            #        roles.append(Role.get_by_id(role_id))
        new_data['role'] = system.get_role_of_user(record,session)
        #new_data['session'] = record.session
        record.update(**new_data)
        system.get_users_from_database()
        return jsonify(User.get_by_id(id).to_client())

    except Exception, e:
        current_app.logger.error("Error occured while updating"
                                     "user record %d: %s" % (id, str(e)))
        abort(500, str(e))
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">1.15</span> Login/Logout</h3>
<div class="outline-text-3" id="text-1-15">
<p>
These are the REST API methods for login and logout.
If the user is already logged in then it will redirect to 'user-list.html'
otherwise it will take a user to 'login.html'.
</p>
</div>

<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">1.15.1</span> Implementation</h4>
<div class="outline-text-4" id="text-1-15-1">
<div class="org-src-container">

<pre class="src src-python">@api.route("/", methods=['GET'])
def index():
    if request.method == 'GET':
        if ('email' in session):
            return render_template("user-list.html")
        else:
            return render_template("login.html")

@api.route("/auth/login", methods=['GET', 'POST'])
def login():
    global system
    user=None
    if request.method == 'POST':
        email = str(request.form['email'])
        url_for_getting_the_user = "%s/users" % \
                                   (APP_URL)
        backend_resp = requests.get(url_for_getting_the_user)
        user_list = backend_resp.json()
        if len(backend_resp.text.encode('ascii')) != 2:
            count = 0
            for user in range(len(user_list)):
                print len(user_list)
                print user_list[user]
                if str(email) == str(user_list[user]['email']):
                    current_app.logger.info("Successfully Logged in")
                    session['email'] = str(user_list[user]['email'])
                    session['role_name'] = str(user_list[user]['role']['name'])
                    session['user_id'] = str(user_list[user]['id'])
                    for u in system.user_set:
                        if u.email==str(email):
                           user=u
                    system.login(user)
                    print system.session_set
                    for x in system.session_set:
                        print x.user.email
                    return redirect("/")
                else:
                    count = count + 1
            if count == len(user_list):
                return render_template("login.html", message="Invalid email id")
            
@api.route('/auth/logout', methods=['GET'])
def logout_handler():
    global system
    
    
    user=None
    ses=None
    for s in system.session_set:
        if(s.user.email == session['email'] ):
            ses=s
    for u in system.user_set:
        if(u.email == session['email']):
            user=u
    system.logout(user,ses)
    session.pop('email', None)
    session.pop('role_name', None)   
    return redirect("/")
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline52" class="outline-2">
<h2 id="orgheadline52"><span class="section-number-2">2</span> Tests for REST API</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">2.1</span> Initialization</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-python"># -*- coding: utf-8 -*-

import unittest
from flask.ext.testing import TestCase
from datetime import datetime
# import json

from src.db import *
from src.app import create_app
from src.op_exceptions import AttributeRequired
from src.api import system
config = {
    'SQLALCHEMY_DATABASE_URI': ''
}
</pre>
</div>
</div>
</div>
