web-app/web-app-old/src/implementation/rest/index.org
** User Tests
   The setup method creates all the tables and the teardown method deletes the
   tables. These methods are called in the beginning and at the end of the test
   cases, respectively.

*** Initialization
#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no
class TestUser(TestCase):

    TESTING = True

    def create_app(self):
        app = create_app(config)
        return app

    def setUp(self):
        db.create_all()

    def tearDown(self):
        db.session.remove()
        db.drop_all()

#+END_SRC


*** test_get_all_users
    Test case for '/users' ['GET']
    Creates an admin and a user and makes a call to '/users' and hence tests get_all_users().
**** Implementation
#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no

    def test_get_all_users(self):
        print "test_get_all_users"

        ###Create Users
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()
        user1 = User(name = "admin user",
                    email = "admin@xyz.com",
                    role=role1)
        user1.save()
        user2 = User(name = "normal user",
                    email="normal@xyz.com",
                    role=role2)
        user2.save()
        r = self.client.get('/users')
        result = json.loads(r.data)
        self.assertEquals(len(result), 2)

#+END_SRC

*** test_get_one_user
     Test case for '/users/<int:id>' ['GET']
     Makes a call to the given route and returns a user, if it is present in
     the user set.
**** Implementation

#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no

    def test_get_one_user(self):
        print "test_get_one_user"

        ### create a User
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()

        user1 = User(name = "admin user",
                    email="admin@xyz.com",
                    role=role1)
        user1.save()
        user2 = User(name="normal user",
                    email="normal@xyz.com",
                    role=role2)
        user2.save()

        r = self.client.get('/users/1')
        result = json.loads(r.data)
        self.assertEqual(result['name'], "admin user")

#+END_SRC

*** test_update_existing_user
    Test case for '/users/<int:id>' ['PUT']
    Tests the updating of a particular user.
**** Implementation

#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no


    def test_update_existing_user(self):
        # Create a user
        # update the same user
        global system
        print "test_update_existing_user"
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()

        user1 = User(name="admin user",
                     email="admin@xyz.com",
                     role=role1)

        user1.save()
        user2 = User(name="normal user",
                     email="normal@xyz.com",
                     role=role2)

        user2.save()

        system.user_set = []
        system.session_set = []

        system.get_users_from_database()
        admin_user = User.get_by_id(1)
        admin_session = Session(user = admin_user)
        system.session_set.append(admin_session)
        
        
        #for x in system.session_set:
        #    print x.to_client()

        payload = {'email': 'abcdef@gmail.com',
                   'name': 'NEW ADMIN',
                   'role_id': [1],
                   'session': 'admin@xyz.com'}
        headers = {'content-type': 'application/json'}
        response = self.client.put("/users/1",
                                   data=json.dumps(payload),
                                   headers=headers)

        self.assertEqual(response.status_code, 200)

#+END_SRC

*** test_create_new_user
    Test case for '/users' ['POST']
    Tests the creation of a new user, according to the bounds of the
    create_user function.
**** Implementation

#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no


    def test_create_new_user(self):
        print "test_create_new_user"
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()

        user1 = User(name = "admin user",
                     email= "admin@xyz.com",
                     role=role1)

        user1.save()
        user2 = User(name="normal user",
                     email="normal@xyz.com",
                     role=role2)

        user2.save()

        payload = {'email': 'ttt@kkk.com',
                   'name': 'nearly normal user',
                   'role': [2],
                   'session': 't@g.com'}

        headers = {'content-type': 'application/json'}

        response = self.client.post("/users",
                                    data=json.dumps(payload),
                                    headers=headers)

        self.assertEqual(response.status_code, 200)


#+END_SRC

*** test_delete_user
    Test case for '/users/<int:id>' [DELETE] 
**** Implementation
#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no

    def test_delete_user(self):
        global system
        print "test_delete_user"
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()

        user1 = User(name="admin user",
                     email="admin@xyz.com",
                     role=role1)

        user1.save()
        user2 = User(name="normal user",
                     email="normal@xyz.com",
                     role=role2)

        user2.save()
        
        system.session_set = []
        system.user_set = []

        system.get_users_from_database()
        #s=Session(user=user1)
        system.add_session(user1)

        headers = {'content-type': 'application/json', 'session': 'admin@xyz.com'}

        response = self.client.delete("/users/2", headers=headers)

        self.assertEqual(response.status_code, 200)


#+END_SRC

*** test_create_role
    Test case for '/roles' ['POST']
**** Implementation

#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no

    def test_create_role(self):
        print "test_create_role"
     

        payload = {'name': 'owner'}

        headers = {'content-type': 'application/json'}

        response = self.client.post("/roles",
                                    data=json.dumps(payload),
                                    headers=headers)

        self.assertEqual(response.status_code, 200)


#+END_SRC 

*** test_update_role
    Test case for '/roles/<int:id>' [PUT]
