web-app/web-app-old/src/implementation/rest/index.html

<div id="outline-container-orgheadline50" class="outline-3">
<h3 id="orgheadline50"><span class="section-number-3">2.2</span> User Tests</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The setup method creates all the tables and the teardown method deletes the
tables. These methods are called in the beginning and at the end of the test
cases, respectively.
</p>
</div>

<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">2.2.1</span> Initialization</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">

<pre class="src src-python">class TestUser(TestCase):

    TESTING = True

    def create_app(self):
        app = create_app(config)
        return app

    def setUp(self):
        db.create_all()

    def tearDown(self):
        db.session.remove()
        db.drop_all()
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">2.2.2</span> test_get_all_users</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Test case for '/users' ['GET']
Creates an admin and a user and makes a call to '/users' and hence tests get_all_users().
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline26"></a>Implementation<br  /><div class="outline-text-5" id="text-2-2-2-1">
<div class="org-src-container">

<pre class="src src-python">    def test_get_all_users(self):
        print "test_get_all_users"

        ###Create Users
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()
        user1 = User(name = "admin user",
                    email = "admin@xyz.com",
                    role=role1)
        user1.save()
        user2 = User(name = "normal user",
                    email="normal@xyz.com",
                    role=role2)
        user2.save()
        r = self.client.get('/users')
        result = json.loads(r.data)
        self.assertEquals(len(result), 2)
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">2.2.3</span> test_get_one_user</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Test case for '/users/&lt;int:id&gt;' ['GET']
Makes a call to the given route and returns a user, if it is present in
the user set.
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline28"></a>Implementation<br  /><div class="outline-text-5" id="text-2-2-3-1">
<div class="org-src-container">

<pre class="src src-python">    def test_get_one_user(self):
        print "test_get_one_user"

        ### create a User
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()

        user1 = User(name = "admin user",
                    email="admin@xyz.com",
                    role=role1)
        user1.save()
        user2 = User(name="normal user",
                    email="normal@xyz.com",
                    role=role2)
        user2.save()

        r = self.client.get('/users/1')
        result = json.loads(r.data)
        self.assertEqual(result['name'], "admin user")
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-orgheadline31" class="outline-4">
<h4 id="orgheadline31"><span class="section-number-4">2.2.4</span> test_update_existing_user</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Test case for '/users/&lt;int:id&gt;' ['PUT']
Tests the updating of a particular user.
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline30"></a>Implementation<br  /><div class="outline-text-5" id="text-2-2-4-1">
<div class="org-src-container">

<pre class="src src-python">    def test_update_existing_user(self):
        # Create a user
        # update the same user
        global system
        print "test_update_existing_user"
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()

        user1 = User(name="admin user",
                     email="admin@xyz.com",
                     role=role1)

        user1.save()
        user2 = User(name="normal user",
                     email="normal@xyz.com",
                     role=role2)

        user2.save()

        system.user_set = []
        system.session_set = []

        system.get_users_from_database()
        admin_user = User.get_by_id(1)
        admin_session = Session(user = admin_user)
        system.session_set.append(admin_session)
        
        
        #for x in system.session_set:
        #    print x.to_client()

        payload = {'email': 'abcdef@gmail.com',
                   'name': 'NEW ADMIN',
                   'role_id': [1],
                   'session': 'admin@xyz.com'}
        headers = {'content-type': 'application/json'}
        response = self.client.put("/users/2",
                                   data=json.dumps(payload),
                                   headers=headers)

        self.assertEqual(response.status_code, 200)
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-orgheadline33" class="outline-4">
<h4 id="orgheadline33"><span class="section-number-4">2.2.5</span> test_create_new_user</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
Test case for '/users' ['POST']
Tests the creation of a new user, according to the bounds of the
create_user function.
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline32"></a>Implementation<br  /><div class="outline-text-5" id="text-2-2-5-1">
<div class="org-src-container">

<pre class="src src-python">    def test_create_new_user(self):
        print "test_create_new_user"
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()

        user1 = User(name = "admin user",
                     email= "admin@xyz.com",
                     role=role1)

        user1.save()
        user2 = User(name="normal user",
                     email="normal@xyz.com",
                     role=role2)

        user2.save()

        payload = {'email': 'ttt@kkk.com',
                   'name': 'nearly normal user',
                   'role': [2],
                   'session': 't@g.com'}

        headers = {'content-type': 'application/json'}

        response = self.client.post("/users",
                                    data=json.dumps(payload),
                                    headers=headers)

        self.assertEqual(response.status_code, 200)
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-orgheadline35" class="outline-4">
<h4 id="orgheadline35"><span class="section-number-4">2.2.6</span> test_delete_user</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
Test case for '/users/&lt;int:id&gt;' [DELETE] 
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline34"></a>Implementation<br  /><div class="outline-text-5" id="text-2-2-6-1">
<div class="org-src-container">

<pre class="src src-python">    def test_delete_user(self):
        global system
        print "test_delete_user"
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()

        user1 = User(name="admin user",
                     email="admin@xyz.com",
                     role=role1)

        user1.save()
        user2 = User(name="normal user",
                     email="normal@xyz.com",
                     role=role2)

        user2.save()
        
        system.session_set = []
        system.user_set = []

        system.get_users_from_database()
        #s=Session(user=user1)
        system.add_session(user1)
        payload = {'session': 'admin@xyz.com'}

        headers = {'content-type': 'application/json'}

        response = self.client.delete("/users/2",
                                      data=json.dumps(payload),
                                      headers=headers)

        self.assertEqual(response.status_code, 200)
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-orgheadline37" class="outline-4">
<h4 id="orgheadline37"><span class="section-number-4">2.2.7</span> test_create_role</h4>
<div class="outline-text-4" id="text-2-2-7">
<p>
Test case for '/roles' ['POST']
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline36"></a>Implementation<br  /><div class="outline-text-5" id="text-2-2-7-1">
<div class="org-src-container">

<pre class="src src-python">    def test_create_role(self):
        print "test_create_role"
     

        payload = {'name': 'owner'}

        headers = {'content-type': 'application/json'}

        response = self.client.post("/roles",
                                    data=json.dumps(payload),
                                    headers=headers)

        self.assertEqual(response.status_code, 200)
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39"><span class="section-number-4">2.2.8</span> test_update_role</h4>
<div class="outline-text-4" id="text-2-2-8">
<p>
Test case for '/roles/&lt;int:id&gt;' [PUT]
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline38"></a>Implementation<br  /><div class="outline-text-5" id="text-2-2-8-1">
