web-app/web-app-old/src/implementation/rest/index.org
**** Implementation

#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no


    def test_update_role(self):
        # Create a user
        # update the same user
        global system
        print "test_update_role"
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()

        user1 = User(name="admin user",
                     email="admin@xyz.com",
                     role=role1)

        user1.save()
        system.get_users_from_database()
        s=Session(user=user1)
        system.add_session(user1)
        

        payload = {'role': 'owner',
                   'session' : 'admin@xyz.com'
                   }
        headers = {'content-type': 'application/json'}
        response = self.client.put("/roles/2",
                                   data=json.dumps(payload),
                                   headers=headers)

        self.assertEqual(response.status_code, 200)

#+END_SRC

*** test_delete_role
    Test case for '/roles/<int:id>' [DELETE]
**** Implementation
#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no

    def test_delete_role(self):
        global system
        print "test_delete_role"
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()

        user1 = User(name="admin user",
                     email="admin@xyz.com",
                     role=role1)

        user1.save()
        system.get_users_from_database()
     
        
        s=Session(user=user1)
        system.add_session(user1)
        payload = {'session': 'admin@xyz.com'}

        headers = {'content-type': 'application/json'}

        response = self.client.delete("/roles/2",
                                      data=json.dumps(payload),
                                      headers=headers)

        self.assertEqual(response.status_code, 200)


#+END_SRC

*** test_get_user_by_email
    Test case for '/roles/<int:id>' [GET]
**** Implementation
#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no

    def test_get_user_by_email(self):
        print "test_get_user_by_email"

        ###Create Users
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()
        user1 = User(name = "admin user",
                    email = "admin@xyz.com",
                    role=role1)
        user1.save()
        user2 = User(name = "normal user",
                    email="normal@xyz.com",
                    role=role2)
        user2.save()
        
        system.user_set = []
        system.session_set = []

        system.get_users_from_database()

        payload = { 'email' : 'normal@xyz.com' }

        
        headers = {'content-type': 'application/json'}
        response = self.client.get("/users/get_email",
                                   data=json.dumps(payload),
                                   headers=headers)
        result = json.loads(response.data)
        self.assertEquals(result['email'], user2.email)

#+END_SRC


*** test_get_email_of_user
    Test case for '/users/<int:id>/email'
**** Implementation
#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no

    def test_get_email_of_user(self):
        print "test_get_email_of_user"

        ###Create Users
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()
        user1 = User(name = "admin user",
                    email = "admin@xyz.com",
                    role=role1)
        user1.save()
        user2 = User(name = "normal user",
                    email="normal@xyz.com",
                    role=role2)
        user2.save()
        
        system.user_set = []
        system.session_set = []

        system.get_users_from_database()
        system.add_session(user1)
        payload = { 'session' : 'admin@xyz.com' }

        
        headers = {'content-type': 'application/json'}
        response = self.client.get("/users/2/email",
                                   data=json.dumps(payload),
                                   headers=headers)
        result = json.loads(response.data)
        self.assertEquals(result['email'], user2.email)

#+END_SRC

*** test_get_name_of_user
    Test case for '/users/<int:id>/name'
**** Implementation
#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no

    def test_get_name_of_user(self):
        print "test_get_name_of_user"

        ###Create Users
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()
        user1 = User(name = "admin user",
                    email = "admin@xyz.com",
                    role=role1)
        user1.save()
        user2 = User(name = "normal user",
                    email="normal@xyz.com",
                    role=role2)
        user2.save()
        
        system.user_set = []
        system.session_set = []

        system.get_users_from_database()
        system.add_session(user1)
        payload = { 'session' : 'admin@xyz.com' }

        
        headers = {'content-type': 'application/json'}
        response = self.client.get("/users/2/name",
                                   data=json.dumps(payload),
                                   headers=headers)
        result = json.loads(response.data)
        self.assertEquals(result['name'], user2.name)

#+END_SRC


*** test_set_email_of_user
    Test case for '/users/<int:id>/email'
**** Implementation
#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no

    def test_set_email_of_user(self):
        print "test_set_email_of_user"

        ###Create Users
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()
        user1 = User(name = "admin user",
                    email = "admin@xyz.com",
                    role=role1)
        user1.save()
        user2 = User(name = "normal user",
                    email="normal@xyz.com",
                    role=role2)
        user2.save()
        
        system.user_set = []
        system.session_set = []

        system.get_users_from_database()
        system.add_session(user1)
        payload = { 'session' : 'admin@xyz.com',
                    'email' : 'abcd@xyz.com'
                    }
        
        headers = {'content-type': 'application/json'}
        response = self.client.put("/users/2/email",
                                   data=json.dumps(payload),
                                   headers=headers)
        result = json.loads(response.data)
        self.assertEquals(result['email'], "abcd@xyz.com")

#+END_SRC


** Run Tests
#+BEGIN_SRC python :tangle ../../tests/test_api.py :eval no

if __name__ == '__main__':
    unittest.main()
#+END_SRC
