web-app/web-app-old/src/implementation/rest/index.html
<div class="org-src-container">

<pre class="src src-python">    def test_update_role(self):
        # Create a user
        # update the same user
        global system
        print "test_update_role"
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()

        user1 = User(name="admin user",
                     email="admin@xyz.com",
                     role=role1)

        user1.save()
        system.get_users_from_database()
        s=Session(user=user1)
        system.add_session(user1)
        

        payload = {'role': 'owner',
                   'session' : 'admin@xyz.com'
                   }
        headers = {'content-type': 'application/json'}
        response = self.client.put("/roles/2",
                                   data=json.dumps(payload),
                                   headers=headers)

        self.assertEqual(response.status_code, 200)
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-orgheadline41" class="outline-4">
<h4 id="orgheadline41"><span class="section-number-4">2.2.9</span> test_delete_role</h4>
<div class="outline-text-4" id="text-2-2-9">
<p>
Test case for '/roles/&lt;int:id&gt;' [DELETE]
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline40"></a>Implementation<br  /><div class="outline-text-5" id="text-2-2-9-1">
<div class="org-src-container">

<pre class="src src-python">    def test_delete_role(self):
        global system
        print "test_delete_role"
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()

        user1 = User(name="admin user",
                     email="admin@xyz.com",
                     role=role1)

        user1.save()
        system.get_users_from_database()
     
        
        s=Session(user=user1)
        system.add_session(user1)
        payload = {'session': 'admin@xyz.com'}

        headers = {'content-type': 'application/json'}

        response = self.client.delete("/roles/2",
                                      data=json.dumps(payload),
                                      headers=headers)

        self.assertEqual(response.status_code, 200)
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-orgheadline43" class="outline-4">
<h4 id="orgheadline43"><span class="section-number-4">2.2.10</span> test_get_user_by_email</h4>
<div class="outline-text-4" id="text-2-2-10">
<p>
Test case for '/roles/&lt;int:id&gt;' [GET]
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline42"></a>Implementation<br  /><div class="outline-text-5" id="text-2-2-10-1">
<div class="org-src-container">

<pre class="src src-python">    def test_get_user_by_email(self):
        print "test_get_user_by_email"

        ###Create Users
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()
        user1 = User(name = "admin user",
                    email = "admin@xyz.com",
                    role=role1)
        user1.save()
        user2 = User(name = "normal user",
                    email="normal@xyz.com",
                    role=role2)
        user2.save()
        
        system.user_set = []
        system.session_set = []

        system.get_users_from_database()

        payload = { 'email' : 'normal@xyz.com' }

        
        headers = {'content-type': 'application/json'}
        response = self.client.get("/users/get_email",
                                   data=json.dumps(payload),
                                   headers=headers)
        result = json.loads(response.data)
        self.assertEquals(result['email'], user2.email)
</pre>
</div>
</div></li></ol>
</div>


<div id="outline-container-orgheadline45" class="outline-4">
<h4 id="orgheadline45"><span class="section-number-4">2.2.11</span> test_get_email_of_user</h4>
<div class="outline-text-4" id="text-2-2-11">
<p>
Test case for '/users/&lt;int:id&gt;/email'
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline44"></a>Implementation<br  /><div class="outline-text-5" id="text-2-2-11-1">
<div class="org-src-container">

<pre class="src src-python">    def test_get_email_of_user(self):
        print "test_get_email_of_user"

        ###Create Users
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()
        user1 = User(name = "admin user",
                    email = "admin@xyz.com",
                    role=role1)
        user1.save()
        user2 = User(name = "normal user",
                    email="normal@xyz.com",
                    role=role2)
        user2.save()
        
        system.user_set = []
        system.session_set = []

        system.get_users_from_database()
        system.add_session(user1)
        payload = { 'session' : 'admin@xyz.com' }

        
        headers = {'content-type': 'application/json'}
        response = self.client.get("/users/2/email",
                                   data=json.dumps(payload),
                                   headers=headers)
        result = json.loads(response.data)
        self.assertEquals(result['email'], user2.email)
</pre>
</div>
</div></li></ol>
</div>

<div id="outline-container-orgheadline47" class="outline-4">
<h4 id="orgheadline47"><span class="section-number-4">2.2.12</span> test_get_name_of_user</h4>
<div class="outline-text-4" id="text-2-2-12">
<p>
Test case for '/users/&lt;int:id&gt;/name'
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline46"></a>Implementation<br  /><div class="outline-text-5" id="text-2-2-12-1">
<div class="org-src-container">

<pre class="src src-python">    def test_get_name_of_user(self):
        print "test_get_name_of_user"

        ###Create Users
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()
        user1 = User(name = "admin user",
                    email = "admin@xyz.com",
                    role=role1)
        user1.save()
        user2 = User(name = "normal user",
                    email="normal@xyz.com",
                    role=role2)
        user2.save()
        
        system.user_set = []
        system.session_set = []

        system.get_users_from_database()
        system.add_session(user1)
        payload = { 'session' : 'admin@xyz.com' }

        
        headers = {'content-type': 'application/json'}
        response = self.client.get("/users/2/name",
                                   data=json.dumps(payload),
                                   headers=headers)
        result = json.loads(response.data)
        self.assertEquals(result['name'], user2.name)
</pre>
</div>
</div></li></ol>
</div>


<div id="outline-container-orgheadline49" class="outline-4">
<h4 id="orgheadline49"><span class="section-number-4">2.2.13</span> test_set_email_of_user</h4>
<div class="outline-text-4" id="text-2-2-13">
<p>
Test case for '/users/&lt;int:id&gt;/email'
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline48"></a>Implementation<br  /><div class="outline-text-5" id="text-2-2-13-1">
<div class="org-src-container">

<pre class="src src-python">    def test_set_email_of_user(self):
        print "test_set_email_of_user"

        ###Create Users
        role1 = Role("admin")
        role1.save()
        role2 = Role("user")
        role2.save()
        user1 = User(name = "admin user",
                    email = "admin@xyz.com",
                    role=role1)
        user1.save()
        user2 = User(name = "normal user",
                    email="normal@xyz.com",
                    role=role2)
        user2.save()
        
        system.user_set = []
        system.session_set = []

        system.get_users_from_database()
        system.add_session(user1)
        payload = { 'session' : 'admin@xyz.com',
                    'email' : 'abcd@xyz.com'
                    }
        
        headers = {'content-type': 'application/json'}
        response = self.client.put("/users/2/email",
                                   data=json.dumps(payload),
                                   headers=headers)
        result = json.loads(response.data)
        self.assertEquals(result['email'], "abcd@xyz.com")
</pre>
</div>
</div></li></ol>
</div>
</div>


<div id="outline-container-orgheadline51" class="outline-3">
<h3 id="orgheadline51"><span class="section-number-3">2.3</span> Run Tests</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-python">if __name__ == '__main__':
    unittest.main()
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2016-05-11 Wed]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2016-06-02 Thu 23:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
